<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="CAT_796973AB_6967_411E_854F_E38330F0DC20">Outlook backup addin settings</string>
      <string id="POL_4A04F786_9D98_40FC_9990_289DDEBE5F6C">Backup prefix</string>
      <string id="POL_29E5E1AD_74D7_4C07_9CCE_C300B5F37EBB">Backup program</string>
      <string id="POL_BF45BD88_3634_4F80_8B88_76BDD098DB0F">Backup suffix</string>
      <string id="POL_4A04F786_9D98_40FC_9990_289DDEBE5F6C_Help">Configures the prefix which is used for the filenames of the backups</string>
      <string id="POL_29E5E1AD_74D7_4C07_9CCE_C300B5F37EBB_Help">Location of backupExecutor.exe</string>
      <string id="POL_BF45BD88_3634_4F80_8B88_76BDD098DB0F_Help">Configures the suffix which is used for the filenames of the backups</string>
      <string id="POL_EFD7F38A_3BB8_4DD3_98F7_3B08728EF721">Countdown in seconds</string>
      <string id="POL_EFD7F38A_3BB8_4DD3_98F7_3B08728EF721_Help">Defines the number of seconds to wait till backup starts</string>
      <string id="POL_A8CDC133_2FEF_4B20_8EAA_C3276A5C5C31">Backup all files</string>
      <string id="POL_A8CDC133_2FEF_4B20_8EAA_C3276A5C5C31_Help">Option whether to backup all outlook files which can be located</string>
      <string id="POL_43AE0FD1_A2F8_4D71_B678_0ACD0C22BCF9">Path to backup program</string>
      <string id="POL_43AE0FD1_A2F8_4D71_B678_0ACD0C22BCF9_Help">Sets the path to BackupExecutor.exe</string>
      <string id="POL_61C37EB0_ADD2_42DF_9613_79749B129EA2">Countdown (in sec.)</string>
      <string id="POL_61C37EB0_ADD2_42DF_9613_79749B129EA2_Help">Activates a countdown before backup starts. During the countdown the backup can be cancelled.</string>
      <string id="POL_9A89057E_763A_476D_B589_B81ED168A96E">Destination path of backup</string>
      <string id="POL_9A89057E_763A_476D_B589_B81ED168A96E_Help">Sets the destination path where the files are copied to</string>
      <string id="POL_BF3F7655_074E_4301_88B7_AEDEA451A2DD">Ignore encryption</string>
      <string id="POL_BF3F7655_074E_4301_88B7_AEDEA451A2DD_Help">Set this flag to true when encrypted outlook files should be copied to a target folder which doesn't support encryption</string>
      <string id="POL_BBBCC395_8A32_4B6A_914D_AD30DF9A0DB3">Interval (in days)</string>
      <string id="POL_BBBCC395_8A32_4B6A_914D_AD30DF9A0DB3_Help">Set this value to the number of days after which a new backup should be started</string>
      <string id="POL_B988DC87_AA3E_4195_B52E_4873658C7115">Files to backup</string>
      <string id="POL_B988DC87_AA3E_4195_B52E_4873658C7115_Help">Configure the files which should be backed up</string>
      <string id="POL_1EB1A792_C72C_422B_8F39_21391B002E0B">Post backup command</string>
      <string id="POL_1EB1A792_C72C_422B_8F39_21391B002E0B_Help">Execute (optionally) the given script</string>
      <string id="POL_274EBBB2_3469_40F4_95EF_07C28897C63B">Show ost-files</string>
      <string id="POL_274EBBB2_3469_40F4_95EF_07C28897C63B_Help">Set this option to true to also display ost-files. Usually the location is not public but can be extracted from the store-id (in some cases)</string>
      <string id="POL_F6EE8B14_5EC5_4A1B_8DA7_79B6F5CDC52F">Store-type blacklist</string>
      <string id="POL_F6EE8B14_5EC5_4A1B_8DA7_79B6F5CDC52F_Help">Comma separated list of store-types (numerical) which should be ignored.

Possible values (right side):

olPrimaryExchangeMailbox = 0
olExchangeMailbox = 1
olExchangePublicFolder = 2
olNotExchange = 3
olAdditionalExchangeMailbox = 4

Valid value is e.g. 1,2</string>
      <string id="POL_10A02353_C014_40E6_ABA6_31E39A4898E7">Use compression</string>
      <string id="POL_10A02353_C014_40E6_ABA6_31E39A4898E7_Help">Compression can be optionally be activated (gzip compression).
Depending on the emails it can be more or less effective.</string>
      <string id="POL_2B9DBA16_C004_4B33_80CF_A57FB4306508">Wait time for file-lock</string>
    </stringTable>
    <presentationTable>
      <presentation id="POL_4A04F786_9D98_40FC_9990_289DDEBE5F6C">
        <text>
        </text>
        <textBox refId="TXT_5D5E28CD_F804_4EEF_ADCC_740CA8B51DFF">
          <label>Prefix</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_29E5E1AD_74D7_4C07_9CCE_C300B5F37EBB">
        <text>
        </text>
        <text>
        </text>
        <textBox refId="TXT_C26E19D6_83DF_434A_A62C_C16994B1D237">
          <label>Location of BackupExecutor.exe</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_BF45BD88_3634_4F80_8B88_76BDD098DB0F">
        <textBox refId="TXT_43F91329_184F_4328_BF46_C9F819499CC6">
          <label>Suffix</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_EFD7F38A_3BB8_4DD3_98F7_3B08728EF721">
        <decimalTextBox refId="DXT_F52B6BD7_AD6C_4CFB_98CB_7C3589BF3EF4" defaultValue="0">Countdown in seconds</decimalTextBox>
      </presentation>
      <presentation id="POL_A8CDC133_2FEF_4B20_8EAA_C3276A5C5C31">
        <checkBox refId="CHK_3D3041A9_2E41_403C_A29A_91D5530EFC6C">Backup all locatable files</checkBox>
      </presentation>
      <presentation id="POL_43AE0FD1_A2F8_4D71_B678_0ACD0C22BCF9">
        <textBox refId="TXT_F7698B59_5DC7_4854_B944_32E5DDF5431C">
          <label>Path to BackupExecutor.exe</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_61C37EB0_ADD2_42DF_9613_79749B129EA2">
        <decimalTextBox refId="DXT_A5C57465_A666_47D1_BFA3_724766B3BE1A" defaultValue="0">Countdown (in sec.)</decimalTextBox>
      </presentation>
      <presentation id="POL_9A89057E_763A_476D_B589_B81ED168A96E">
        <textBox refId="TXT_D7680AF8_4B1A_40E3_A26D_FEED5C21A64E">
          <label>Destination path</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_BF3F7655_074E_4301_88B7_AEDEA451A2DD">
        <checkBox refId="CHK_DC2D95DC_2ED0_48B0_A6D0_41CDD49531BB">Ignore encryption at target folder</checkBox>
      </presentation>
      <presentation id="POL_BBBCC395_8A32_4B6A_914D_AD30DF9A0DB3">
        <decimalTextBox refId="DXT_CBD6BD17_7C68_41ED_9E06_A28DEA60B2F3">Interval (in days)</decimalTextBox>
      </presentation>
      <presentation id="POL_B988DC87_AA3E_4195_B52E_4873658C7115">
	  	<text>Files to backup</text>
        <multiTextBox refId="TXT_3D4BDCEC_5F97_498B_80A1_6EB4C82A38FB" />
      </presentation>
      <presentation id="POL_1EB1A792_C72C_422B_8F39_21391B002E0B">
        <textBox refId="TXT_9F673EA2_0C8C_42C7_8CB9_E516052FD038">
          <label>Command to execute after backup</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_274EBBB2_3469_40F4_95EF_07C28897C63B">
        <checkBox refId="CHK_5674386D_E521_4D8F_BB52_0A291FF49856">Show ost-files</checkBox>
      </presentation>
      <presentation id="POL_F6EE8B14_5EC5_4A1B_8DA7_79B6F5CDC52F">
        <textBox refId="TXT_BD921970_49F7_457E_AEBA_88256BFB0EB5">
          <label>Comma separated list of store types to hide</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="POL_10A02353_C014_40E6_ABA6_31E39A4898E7">
        <checkBox refId="CHK_177A120F_1853_422B_85F1_66A9DF1AFDC2">Use compression</checkBox>
      </presentation>
      <presentation id="POL_2B9DBA16_C004_4B33_80CF_A57FB4306508">
        <decimalTextBox refId="DXT_4736FFAE_5D6C_4A0E_A1AA_B8AACBF0EC2F" defaultValue="500">Max. time to wait for file lock (in millisec.)</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>